app/views/camps/show.html.erb

SELECT "students".* FROM "students" WHERE "students"."camp_id" = ?  [["camp_id", 1]]
---
          <p>Students Attending:</p>
          <% if @camp.students.length > 0  %>