app/controllers/activities_controller.rb

  def set_teachers
    @teachers = Teacher.all.sort_by { |t| t.name }
---
SELECT "teachers".* FROM "teachers"

  def set_camps
    @camps = Camp.all.sort_by { |c| c.name }
---
SELECT "camps".* FROM "camps"

  def set_skills
    @skills = Skill.all.sort_by { |s| s.name }
---
SELECT "skills".* FROM "skills"