app/controllers/camps_controller.rb

  def show
    @camp = Camp.find(params[:id])
---
SELECT  "camps".* FROM "camps" WHERE "camps"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]