app/controllers/camps_controller.rb

SELECT "camps".* FROM "camps"
---
  def index
    @camps = Camp.all

SELECT  "camps".* FROM "camps" WHERE "camps"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def set_camp
    @camp = Camp.find(params[:id])