app/controllers/teachers_controller.rb

INSERT INTO "teachers" ("name", "username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "lob"], ["username", "lo"], ["password", "lo"], ["created_at", "2018-10-01 16:16:24.248808"], ["updated_at", "2018-10-01 16:16:24.248808"]]
---
  def create
       @teacher = Teacher.new(teacher_params)
    if @teacher.valid?
       @teacher.save

SELECT  "camp_teachers".* FROM "camp_teachers" WHERE "camp_teachers"."teacher_id" = ? LIMIT ?  [["teacher_id", 14], ["LIMIT", 1]]
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
  def set_teacher
    @teacher = Teacher.find(params[:id])

SELECT "camps".* FROM "camps"
---
  def set_camps
    @camps = Camp.all.sort_by { |c| c.name }

SELECT "skills".* FROM "skills"
---
  def set_skills
    @skills = Skill.all.sort_by { |s| s.name }